A. Kindly fill the missing values with
   1. value
   2. Statistical value
   3. Filling  method

B. Create pivot table for  position and average salary.

C. Group the data using group by as per gender  and average age.

In [1]:
import pandas as pd
import numpy as np

In [108]:
df = pd.read_excel(r"C:\Users\sathi\Downloads\ethnic_diversity.xlsx")

In [11]:
df.head(5)

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White

In [5]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             3
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### fill the missing values with value

In [32]:
df[df['Position'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
91,"Desimone, Carl",1501072124,NaN,MA,2061.0,M,NaN,US Citizen,Active,NaN,15736.71,26,White
95,"Kirill, Alexandra",903013071,NaN,MA,2127.0,F,Married,US Citizen,Voluntarily Terminated,Production,37619.00,44,White
151,"Engdahl, Jean",1007020403,NaN,MA,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White

In [33]:
df['Position'].fillna("Accountant I",inplace = True)

In [34]:
df['Position'].isna().sum()

0

In [28]:
df[df['State'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
81,"Liebig, Ketsia",1103024679,Production Manager,NaN,2110.0,F,Married,US Citizen,Active,Production,28520.00,35,White
151,"Engdahl, Jean",1007020403,NaN,NaN,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White

In [29]:
df["State"].fillna("MA",inplace=True)

In [35]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [36]:
df["Zip"].fillna(2110.0,inplace=True)

In [37]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [38]:
df["Gender"].fillna("M",inplace=True)

In [39]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [40]:
df["MaritalDesc"].fillna("Single",inplace=True)

In [41]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [42]:
df["CitizenDesc"].fillna("US Citizen",inplace=True)

In [43]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [44]:
df.head()

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White

In [45]:
df["Department"].fillna("Admin Offices",inplace=True)

In [46]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           0
Salaries            12
age                  0
Race                 9
dtype: int64

In [47]:
df["Salaries"].fillna(700,inplace=True)

In [48]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                9
dtype: int64

In [49]:
df["Race"].fillna("White",inplace=True)

In [50]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

### fill the missing values with statistical value

In [51]:
df.head()

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,White
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,700.00,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White

In [61]:
df["Position"].mode()[0]

'Production Technician I'

In [59]:
df["Position"].fillna(df["Position"].mode()[0],inplace=True)

In [60]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [64]:
df["State"].fillna(df["State"].mode()[0],inplace=True)

In [65]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [66]:
df["Zip"].fillna(df["Zip"].median(),inplace=True)

In [67]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [68]:
df['Gender'].fillna(df["Gender"].mode()[0],inplace=True)

In [69]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [70]:
df["MaritalDesc"].fillna(df["MaritalDesc"].mode()[0],inplace=True)

In [71]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [73]:
df["CitizenDesc"].fillna(df["CitizenDesc"].mode()[0],inplace=True)

In [74]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [75]:
df["Department"].fillna(df["Department"].mode()[0],inplace=True)

In [76]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           0
Salaries            12
age                  0
Race                 9
dtype: int64

In [77]:
df["Salaries"].fillna(df["Salaries"].mean(),inplace=True)

In [78]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                9
dtype: int64

In [80]:
df["Race"].fillna(df["Race"].mode()[0],inplace=True)

In [81]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

### fill the missing values with filling Method
 1. **bfill**
 2. **ffill**

In [87]:
df.head()

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White

In [89]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             3
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [90]:
df["Position"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\1127056499.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Position"].fillna(method="bfill",inplace=True)

In [91]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [92]:
df["State"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3923456966.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["State"].fillna(method="bfill",inplace=True)

In [93]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [94]:
df["Zip"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\838756303.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Zip"].fillna(method="bfill",inplace=True)

In [95]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [96]:
df["Gender"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3944061885.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Gender"].fillna(method="bfill",inplace=True)

In [97]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [98]:
df["MaritalDesc"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\178151227.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["MaritalDesc"].fillna(method="bfill",inplace=True)

In [99]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [100]:
df["CitizenDesc"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\1901394005.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["CitizenDesc"].fillna(method="bfill",inplace=True)

In [101]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [102]:
df["Department"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3838463905.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Department"].fillna(method="bfill",inplace=True)

In [103]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           0
Salaries            12
age                  0
Race                 9
dtype: int64

In [104]:
df["Salaries"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\1711028853.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Salaries"].fillna(method="bfill",inplace=True)

In [105]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                9
dtype: int64

In [106]:
df["Race"].fillna(method="bfill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\1565456734.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Race"].fillna(method="bfill",inplace=True)

In [107]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

### ffill

In [109]:
df.head()

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White

In [110]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             3
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [111]:
df["CitizenDesc"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3642993704.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["CitizenDesc"].fillna(method="ffill",inplace=True)

In [112]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             3
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [113]:
df["Position"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\581306545.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Position"].fillna(method="ffill",inplace=True)

In [114]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [115]:
df["State"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3191397999.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["State"].fillna(method="ffill",inplace=True)

In [116]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [117]:
df["Zip"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3627224060.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Zip"].fillna(method="ffill",inplace=True)

In [118]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               7
MaritalDesc          9
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [119]:
df["Gender"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3895409172.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Gender"].fillna(method="ffill",inplace=True)

In [120]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          9
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [121]:
df["MaritalDesc"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\3124755822.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["MaritalDesc"].fillna(method="ffill",inplace=True)

In [122]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [123]:
df["Department"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\2529467920.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Department"].fillna(method="ffill",inplace=True)

In [124]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           0
Salaries            12
age                  0
Race                 9
dtype: int64

In [125]:
df["Salaries"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\81974517.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Salaries"].fillna(method="ffill",inplace=True)

In [126]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                9
dtype: int64

In [127]:
df["Race"].fillna(method="ffill",inplace=True)

C:\Users\sathi\AppData\Local\Temp\ipykernel_15632\2191991060.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Race"].fillna(method="ffill",inplace=True)

In [128]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

### B. Create pivot table for  position and average salary.

In [135]:
df.pivot_table(values="Salaries",columns="Position",aggfunc="mean")

Position,Accountant I,Administrative Assistant,Area Sales Manager,BI Developer,BI Director,CIO,Data Analyst,Data Analyst,Data Architect,Database Administrator,...,Production Technician I,Production Technician II,Sales Manager,Senior BI Developer,Shared Services Manager,Software Engineer,Software Engineering Manager,Sr. Accountant,Sr. DBA,Sr. Network Engineer
Salaries,674.28,31389.883333,41823.218519,36395.085,4160.0,26418.01,37772.945714,42304.75,90016.01,33813.996,...,34942.552941,33803.863333,34093.246667,71293.676667,45262.975,39892.308889,40208.0,27349.755,31954.975,28438.6

### C. Group the data using group by as per gender  and average age.

In [138]:
df.groupby(by="Gender")["age"].mean()

Gender
F     38.659091
M     38.746269
Name: age, dtype: float64